salal-m/pycom-micropython-sigfox/esp32/ftp/updater.c
    // Getting the offset of the current image in the flash
    if (boot_info.ActiveImg == IMG_ACT_FACTORY) {
        old_bin_offset = IMG_FACTORY_OFFSET;
    } else {
        old_bin_offset = (esp32_get_chip_rev() > 0 ? IMG_UPDATE1_OFFSET_8MB : IMG_UPDATE1_OFFSET_4MB);
    }

    ESP_LOGI(TAG, "Old_Offset: %d, Offset: %d, Size: %d, ChunkSize: %d, Chunk: %d\n",
             old_bin_offset, updater_data.offset, updater_data.size, updater_data.chunk_size, updater_data.current_chunk);
    ESP_LOGI(TAG, "BootInfoSize: %d, BootInfoActiveImg: %d\n",
             boot_info.size, boot_info.ActiveImg);

    // File format:
    //     0   8   "BSDIFF40"
    //     8   8   X
    //     16  8   Y
    //     24  8   sizeof(newfile)
    //     32  X   bzip2(control block)
    //     32+X    Y   bzip2(diff block)
    //     32+X+Y  ??? bzip2(extra block)
    // with control block a set of triples (x,y,z) meaning "add x bytes
    // from oldfile to x bytes from the diff block; copy y bytes from the
    // extra block; seek forwards in oldfile by z bytes".

    // Reading header of the patch file

    if (ESP_OK != updater_spi_flash_read(patch_offset, header, 32, false)) {
        ESP_LOGE(TAG, "Error while reading patch file header\n");
        goto return_status;
    }

    // Check for the appropriate magic
    if (memcmp(header, "BSDIFF40", 8) != 0) {
        ESP_LOGE(TAG, "Invalid header\n");
        goto return_status;
    }

    ESP_LOGI(TAG,"Header Verified\n");

    // Reading lengths from header
    bzctrllen = offtin(header + 8);
    bzdatalen = offtin(header + 16);
    newsize = offtin(header + 24);

    xtralen = patch_size - (32 + bzctrllen + bzdatalen);

    ESP_LOGI(TAG, "CtrlLen: %d, DataLen: %d, NewSize: %d, ExtraLen: %d\n", bzctrllen, bzdatalen, newsize, xtralen);

    if ((bzctrllen < 0) || (bzdatalen < 0) || (newsize < 0) || (xtralen < 0)) {
        ESP_LOGE(TAG, "Invalid Block Sizes\n");
        goto return_status;
    } else {
        const int FLASH_READ_WRITE_SIZE = 512;              // Number of bytes read/written to flash at a time
        const int BZLIB_MEM = 64116 + 200000 + 50000 + 100; // Memory required by BZLIB during decompression (+100 byte buffer)

        uint16_t i = 0;
        uint32_t inlen;
        unsigned char *in_buf = NULL;
        unsigned char *ctrl_buf = NULL, *ctrl_ptr = NULL;
        unsigned char *diff_buf = NULL, *diff_ptr = NULL;
        unsigned char *xtra_buf = NULL, *xtra_ptr = NULL;
        unsigned char *old_bin_buf = NULL;                  // Pointer to read parts of old binary

        int ctrl[3];                                        // Buffer to read control block values from the patch file (NOTE: Its value can be negative)
        int oldpos = 0;                                     // Read pointer for old binary
        int newpos = 0;                                     // Read pointer for the patched binary

        unsigned int ctrl_len, diff_len, xtra_len;
        int ret = 0;

        // Get the available memory in the SPIRAM
        int avail_mem = heap_caps_get_largest_free_block(MALLOC_CAP_SPIRAM);

        // Subtract the memory needed by BZLIB
        avail_mem = avail_mem - BZLIB_MEM;

        // The memory required by the IN BUFFER is the max of all the compressed blocks sizes
        inlen = (bzctrllen > bzdatalen) ? bzctrllen : bzdatalen;
        inlen = (inlen > xtralen) ? inlen : xtralen;

        ESP_LOGD(TAG, "Going to allocate memory for blocks buffer: %d, INLEN: %d\n", avail_mem, inlen);
        in_buf = heap_caps_malloc(avail_mem, MALLOC_CAP_SPIRAM);

        if(in_buf == NULL)
        {
            ESP_LOGE(TAG, "Failed to allocate the buffer memory of size %d\n", avail_mem);
            goto free_mem_and_ret;
        }

        // Reading the Control Block from the flash
        if (ESP_OK != updater_spi_flash_read(patch_offset + 32, in_buf, bzctrllen, false)) {
            ESP_LOGE(TAG, "Error while reading control block\n");
            goto free_mem_and_ret;
        }

        ctrl_ptr = ctrl_buf = in_buf + inlen;
        ctrl_len = avail_mem - inlen;


        ret = BZ2_bzBuffToBuffDecompress((char *)ctrl_buf, &ctrl_len, (char *)in_buf, bzctrllen, 1, 4);

        if (BZ_OK == ret) {
            ESP_LOGD(TAG, "Control Block Decompressed. Length: %d --> %d\n", bzctrllen, ctrl_len);
        } else {
            ESP_LOGE(TAG, "Control Block Decompression FAILED. Error Code: %d, ctrl_len: %d\n", ret, ctrl_len);
            goto free_mem_and_ret;
        }

        if (bzdatalen > inlen) {
            printf("Data Block length greater than %d\n", inlen);
            goto free_mem_and_ret;
        }

        // Reading Diff Data Block from the flash
        if (ESP_OK != updater_spi_flash_read(patch_offset + bzctrllen + 32, in_buf, bzdatalen, false)) {
            printf("Error while reading diff block\n");
            goto free_mem_and_ret;
        }

        diff_ptr = diff_buf = ctrl_buf + ctrl_len;
        diff_len = avail_mem - inlen - ctrl_len;

        ret = BZ2_bzBuffToBuffDecompress((char *)diff_buf, &diff_len, (char *)in_buf, bzdatalen, 1, 4);

        if (BZ_OK == ret) {
            ESP_LOGD(TAG, "Data Block Decompressed. Length: %d --> %d\n", bzdatalen, diff_len);
        } else {
            ESP_LOGE(TAG, "Data Block Decompression FAILED. Error Code: %d, diff_len: %d\n", ret, diff_len);
            goto free_mem_and_ret;
        }

        // Decompressing EXTRA BYTES Block
        if (xtralen > inlen) {
            ESP_LOGE(TAG, "Extra Block length greater than %d\n", inlen);
            goto free_mem_and_ret;
        }

        // Reading Extra Bytes Block from the flash
        if (ESP_OK != updater_spi_flash_read(patch_offset + 32 + bzctrllen + bzdatalen, in_buf, xtralen, false)) {
            ESP_LOGE(TAG, "Error while reading extra block\n");
            goto free_mem_and_ret;
        }

        xtra_ptr = xtra_buf = diff_buf + diff_len;
        xtra_len = avail_mem - inlen - ctrl_len - diff_len;

        ret = BZ2_bzBuffToBuffDecompress((char *)xtra_buf, &xtra_len, (char *)in_buf, xtralen, 1, 4);

        if (BZ_OK == ret) {
            ESP_LOGD(TAG, "Extra Block Decompressed. Length: %d --> %d\n", xtralen, xtra_len);
        } else {
            ESP_LOGE(TAG, "Extra Block Decompression FAILED. Error Code: %d, xtra_len: %d\n", ret, xtra_len);
            goto free_mem_and_ret;
        }

