salal-m/pycom-micropython-sigfox/esp32/ftp/updater.c
        ret = spi_flash_write_encrypted(boot_info_offset, (void *)buff, len_aligned_16);
    } else { // not-encrypted flash, just write directly boot_info
            ret = spi_flash_write(boot_info_offset, (void *)boot_info, sizeof(boot_info_t));
    }

    if (ESP_OK != ret) {
        ESP_LOGE(TAG, "Saving boot info failed\n");
    } else {
            ESP_LOGI(TAG, "Boot info saved OK\n");
    }

    return (ESP_OK == ret);
}

int updater_ota_next_slot_address() {

    int ota_offset = (esp32_get_chip_rev() > 0 ? IMG_UPDATE1_OFFSET_8MB : IMG_UPDATE1_OFFSET_4MB);

    // check which one should be the next active image
    if (updater_read_boot_info (&boot_info, &boot_info_offset)) {
        // if we still have an image pending for verification, keep overwriting it
        if (boot_info.Status == IMG_STATUS_CHECK) {
            if(boot_info.ActiveImg == IMG_ACT_FACTORY)

            {
                ota_offset = IMG_FACTORY_OFFSET;
            }
            else
            {
                ota_offset = (esp32_get_chip_rev() > 0 ? IMG_UPDATE1_OFFSET_8MB : IMG_UPDATE1_OFFSET_4MB);
            }
        }
        else
        {
            if(boot_info.ActiveImg == IMG_ACT_FACTORY)

            {
                ota_offset = (esp32_get_chip_rev() > 0 ? IMG_UPDATE1_OFFSET_8MB : IMG_UPDATE1_OFFSET_4MB);
            }
            else
            {
                ota_offset = IMG_FACTORY_OFFSET;
            }
        }
    }

    ESP_LOGI(TAG, "Next slot address: 0x%6X\n", ota_offset);

    return ota_offset;
}

/******************************************************************************
 DEFINE PRIVATE FUNCTIONS
 ******************************************************************************/

static esp_err_t updater_spi_flash_read(size_t src, void *dest, size_t size, bool allow_decrypt)
{
    if (allow_decrypt && esp_flash_encryption_enabled()) {
        return spi_flash_read_encrypted(src, dest, size);
    } else {
        return spi_flash_read(src, dest, size);
    }
}

/* @note Both dest_addr and size must be multiples of 16 bytes. For
 * absolute best performance, both dest_addr and size arguments should
 * be multiples of 32 bytes.
*/
static esp_err_t updater_spi_flash_write(size_t dest_addr, void *src, size_t size,
                                        bool write_encrypted)
{
    if (write_encrypted && esp_flash_encryption_enabled()) {
        return spi_flash_write_encrypted(dest_addr, src, size);
    } else {
        return spi_flash_write(dest_addr, src, size);
    }
}

#ifdef DELTA_UPDATE_ENABLED
/* @brief Checks whether the image present in the inactive partition a patch
 * file or not.
 */
static bool updater_is_delta_file(void)
{
    unsigned int offset;
    unsigned char header[32] = {0};

    // Basically doing all that updater_ota_next_slot_address() does minus reading the bootinfo since we haven't saved it yet.
    if (boot_info.Status == IMG_STATUS_CHECK)
    {
        if (boot_info.ActiveImg == IMG_ACT_FACTORY)

        {
            offset = IMG_FACTORY_OFFSET;
        }
        else
        {
            offset = (esp32_get_chip_rev() > 0 ? IMG_UPDATE1_OFFSET_8MB : IMG_UPDATE1_OFFSET_4MB);
        }
    }
    else
    {
        if (boot_info.ActiveImg == IMG_ACT_FACTORY)

        {
            offset = (esp32_get_chip_rev() > 0 ? IMG_UPDATE1_OFFSET_8MB : IMG_UPDATE1_OFFSET_4MB);
        }
        else
        {
            offset = IMG_FACTORY_OFFSET;
        }
    }

    if(ESP_OK != updater_spi_flash_read(offset, header, 32, false))
    {
        printf("Error while reading patch file header\n");
        ESP_LOGE(TAG, "err1\n");
        return false;
    }

    // Check for appropriate magic
    if (memcmp(header, "BSDIFF40", 8) != 0)
    {
        printf("Header does not match the delta file header. This is not a valid delta file.\n");
        ESP_LOGE(TAG, "Invalid header\n");

        return false;
    }

    return true;
}
#endif